In [1]:
import pandas as pd

# Series

In [8]:
data = ['1', '2', '3', '4', '5']

In [9]:
s = pd.Series(data)

In [10]:
s

0    1
1    2
2    3
3    4
4    5
dtype: object

In [11]:
index = ['Linha' + str(i) for i in range(5)]

In [12]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [13]:
s = pd.Series(data = data, index = index)

In [14]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: object

In [15]:
data = {'Linha ' + str(i): i + 1 for i in range(5)}

In [16]:
data

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [17]:
s = pd.Series(data)

In [18]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [19]:
s1 = s + 2

In [20]:
s1

Linha 0    3
Linha 1    4
Linha 2    5
Linha 3    6
Linha 4    7
dtype: int64

In [21]:
s2 = s + s1

In [22]:
s2

Linha 0     4
Linha 1     6
Linha 2     8
Linha 3    10
Linha 4    12
dtype: int64

# DataFrame

In [24]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [25]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [26]:
df1 = pd.DataFrame(data)

In [27]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [28]:
index = ['Linha ' + str(i) for i in range(3)]

In [29]:
index

['Linha 0', 'Linha 1', 'Linha 2']

In [30]:
df1 = pd.DataFrame(data, index)

In [31]:
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [33]:
columns = ['Coluna ' + str(i) for i in range(3)]
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [34]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [35]:
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [51]:
data = {'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
        'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
        'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [52]:
data

{'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
 'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
 'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [56]:
df2 = pd.DataFrame(data)

In [57]:
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [58]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [59]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [60]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [61]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [62]:
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [63]:
df1[df1 > 0] = 'A'

In [64]:
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [65]:
df2[df2 > 0] = 'B'
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [66]:
df3[df3 > 0] = 'C'
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [67]:
df4 = pd.concat([df1, df2, df3])

In [68]:
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [69]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C